import { getArticlesByCategory } from "@/utils/blog/articles-functions";
import ObjectionsMainPageMetadata from "@/assets/blog/metadata/objections-main-page";
import SectionWithSlider from "@/components/blog-components/ui/page-section/section-with-slider";


export const metadata = ObjectionsMainPageMetadata();

export default function ObjectionsMainPage() {
  const section_one_section_object = {
    title: "القسم الأول: الإختلافات الكمية أو العددية",
    description: "يتناول هذا القسم الإدعاءات القائلة بأنه يوجد تناقض بين تصريحات آيات الكتاب المقدس عن تعداد بعض الأمور المختلفة.",
    link: "/objections/section-1",
    articles: getArticlesByCategory("الإختلافات-الكمية-والعددية"),
    reversed: false,
  }
  const section_two_section_object = {
    title: "القسم الثاني: الإختلافات في أسماء الأشخاص والمواقع، والأنساب",
    description: "يتناول هذا القسم الإدعاءات القائلة بأن الكتاب المُقدَّس يخلط بين أسماء الأشخاص والمواقع، أو أنه يذكر بشكل خاطئ صلات القُرْبى بين أشخاص مُعَيَّنين. ",
    link: "/objections/section-2",
    articles: getArticlesByCategory("أسماء-الأشخاص"),
    reversed: true,
  }
  const section_three_section_object = {
    title: "القسم الثالث: الإختلافات في توقيت الأحداث",
    description: "يتم في الكثير من الأحيان تقديم تصريحات تفيد بأن الكتاب المُقدَّس يناقض نفسه فيما يتعلق بتوقيت الأحداث التاريخية التي ينقلها لنا. فلنفترض أن إحدى آيات الكتاب المُقدَّس تقول بأن الحدث (أ) قد وقع قبل الحدث (ب)، و في الوقت عينه توجد آية أُخرى تُصرَّح بأن الحدث (ب) قد وقع أولاً، ألن يتسبب هذا الأمر مشكلة؟ ",
    link: "/objections/section-3",
    articles: getArticlesByCategory("توقيت-الأحداث"),
    reversed: false,
  }
  const section_four_section_object = {
    title: "القسم الرابع: الإختلافات بين المُسَبِّبْ والنَّاتِج",
    description: "سوف نقوم في هذا القسم بفحص الإدعاءات التي يتم تقديمها بأن الكتاب المقدس يناقض نفسه فيما يختص بالمسببات – أي: مَنْ الشخص أو ما الأمْرُ الذي تسبب بوقوع أحداث معيّنة؟ ونجد أنه يتم تقديم إحدى الآيات على أنها تُقَدِّمُ مُسبِّباً معيناً في الوقت الذي تُقدِّم آية أُخرى مُسبِّباً آخر، فأيٌّ منهما هو الصحيح؟ ",
    link: "/objections/section-4",
    articles: getArticlesByCategory("العلاقة-السببية"),
    reversed: true,
  }
  const section_five_section_object = {
    title: "القسم الخامس: الإختلافات في التفاصيل",
    description: "نجد في البعض من آيات الكتاب المقدس بعض التفاصيل التي تعطي الانطباع بأنها غير متوافقة مع التفاصيل التي تقدمها آيات آُخرى تتعامل مع ذات الموضوع. ويكون الأمر الغالب هو أن النُّقاد يشيرون إلى الاختلافات في الطرق التي يقوم بها كُتَّاب الأناجيل بتسجيل الأحداث، والأمر الأكيد أنَّه يوجد اختلافات من هذا النوع. لكن السؤال هو: هل هي تناقضات أم أنها اختلافات متوافقة؟",
    link: "/objections/section-5",
    articles: getArticlesByCategory("إختلافات-التفاصيل"),
    reversed: false,
  }
  return (
    <main className="page-main uni-text-color" aria-label="Devotions">
      <div className="page-layer-container">
        <section aria-labelledby="article-heading">
        <header >
        <h1>التناقضات المفترضة في الكتاب المقدس
            </h1>
            <p id="page-heading" className="sr-only">التناقضات المفترضة في الكتاب المقدس
            </p>
            <p>
              يتواجد الكثير من الإدعاءات المنتشرة عبر فضاء المواقع الإلكترونية بأنَّ الكتاب المقدس مليء بالتناقضات، وبالتالي فإنَّه ليس مصدراً موثوقاً للحقيقة. كما يتم تقديم لوائح طويلة من الإنتقادات التي تتضمن إدعاءات بوجود آيات تُقدِّمُ تصريحات تناقض بعضها البعض، فما هي حقيقة هذه الإدعاءات؟
            </p>
            <p>
              تقدم لكم هذه السلسلة من المقاطع المصورة نظرة عامة على هذه الآيات بالإضافة إلى تحليل منطقي لما يُعتقد بأنَّه تناقض بين الآيات وذلك بالإعتماد على علم المنطق.
            </p>
            <p>
              إن هذه الدراسات مبنية بشكل أساسي على كتاب بعنوان: Keeping Faith in an Age of Reason: Refuting Alleged Bible Contradictions. للدكتور جيسون لايل.            </p>
            <p>
              عند القيام باستقصاء لهذه الإدعاءات المطالبة بأمثلة عن الآيات التي يُفترض بها أن تكون متناقضةً بعضها مع بعض، نواجَه غالباً بردّ فعل عاطفي ينطوي على تكرار لأخطاء ومغالطات منطقية عديدة. بالإضافة إلى التماس العذر بوجود عدد من اللوائح التي تُقدِّم كماً كبيراً من الآيات التي يفترض أنها تتناقض بعضها مع بعض.
            </p>
            <p>
              إن ما سبق يُظهر أن معظم نُقّاد الكتاب المقدس غير مهتمين بالتدقيق بانتقاداتهم أو القيام بدراسات عقلانية لهذه الإدعاءات. إنهم وبشكل مباشر يُظهرون عدم محبتهم للكتاب المقدس وتعاليمه، وبالمطلق يُظهرون تحجّر قلبهم وحاجتهم إلى التجديد والولادة الثانية.
            </p>
            <p>
              قبل أن تشعروا بالتهديد نتيجةً لوجود أعداد كبيرة من المُدخلات في هذه اللوائح، ندعوكم إلى البدء بتفقد هذه الإدعاءات بشكل فردي وشخصي، وعدم تجاهل التساؤلات التي قد تمتلكونها حيال العديد من هذه الإنتقادات. إن هذه العملية قد تكون مضنية وتتطلب بذل الجهد وطلب المساعدة في بعض الأحيان، إلا أن العائد هو تثبيت الإيمان والصيرورة على استعداد لمواجهة الهجمات الضروس التي قد تواجه إيماننا وعقيدتنا.
            </p>
            <p>
              إن عملية التدقيق في هذه الإعتراضات سُوف تقوم بإظهار كيف أن النقاد – وفي مُعظم الحالات – لم يقرأوا الآيات بطريقة أمينة، أو أنهم قاموا باقتصاص هذه الآيات من سياقها النصي لوضعها في سياق يُناسب رفضهم للحق الكتابي. في بعض الحالات الأُخرى، نجد أن النقّاد يقومون بارتكاب أخطاء منطقية في مقاربتهم وتحليلهم للآيات. كما ويوجد أيضاً استخدام للفروق التوافقية التي سوف نقوم بالتعامل معها بشكل أوفى عند استخدامها في هذه الدراسات.
            </p>
            <p>
              إن رحلتنا هذه، التي نرجوا أن تكون شيّقة ومفيدة لكم، عبر مئات الإعتراضات والإدعاءات المختلفة سوف تحمل الكثير من التحديات والبركات علينا، ذلك أننا سوف نقوم بتقديم وقراءة الآيات من الكتاب المقدس بطريقة متأنية ودقيقة لمعرفة الحق القادر على تحريرنا. سوف يتكشف لنا كيف أن غياب وجود أي تناقض حقيقيّ بين آيات الكتاب المقدس يُظهر حقيقةً كان قد أعلن عنها الروح القدس على لسان بولس الرسول في رسالته إلى أهل رومية حين قال:
            </p>
            <p>
              فغَضَبُ اللهِ مُعلَنٌ مِنَ السّماءِ على كُفرِ البَشَرِ وشَرّهِم، يَحجُبونَ الحقّ بِمَفاسِدِهِم، لأنّ ما يَقدِرُ البَشَرُ أنْ يَعرِفوهُ عَنِ اللهِ جَعلَهُ اللهُ واضِحًا جَلِـيّا لهُم. فمُنذُ خلَقَ اللهُ العالَمَ، وصِفاتُ اللهِ الخَفِـيّةُ، أي قُدرَتُهُ الأزلِـيّةُ وأُلوهِيّتُهُ، واضِحَةٌ جَلِـيّةٌ تُدرِكُها العُقولُ في مَخلوقاتِهِ. فلا عُذرَ لهُم، إذًا. عَرَفوا اللهَ، فما مَجّدوهُ ولا شكَروهُ كإِلهٍ، بَلْ زاغَت عُقولُهُم ومَلأ الظّلامُ قُلوبَهُم الغَبـيّةَ. زَعَموا أنّهُم حُكماءُ، فصاروا حَمقى واَستَبْدَلوا بِمَجدِ اللهِ الخالِدِ صُوَرًا على شاكِلَةِ الإنسانِ الفاني والطّيورِ والدّوابِ والزّحّافاتِ. لذلِكَ أسلَمَهُمُ اللهُ بِشَهَواتِ قُلوبِهِم إلى الفُجورِ يُهينونَ بِه أجسادَهُم. اَتّخَذوا الباطِلَ بَدَلاً مِنَ الحقّ الإلَهيّ وعَبَدوا المَخلوقَ وخَدَموهُ مِنْ دُونِ الخالِقِ، تَبارَكَ إلى الأبدِ آمين.
              رومية ١: ١٨-٢٥ - الترجمة العربية المشتركة
            </p>
          </header>
        </section>
        <SectionWithSlider sectionObject={section_one_section_object} />
        <SectionWithSlider sectionObject={section_two_section_object} />
        <SectionWithSlider sectionObject={section_three_section_object} />
        <SectionWithSlider sectionObject={section_four_section_object} />
        <SectionWithSlider sectionObject={section_five_section_object} />
      </div>
    </main>
  );
}