import YouTube, { YouTubeProps } from "react-youtube";
export default function ObjectionFallacies(props) {
  const article = props.article;
  const opts = {
    width: "100%",
    height: "250",
    playerVars: {
      autoplay: 0,
      controls: 1,
      light: 1,
    },
  };
  // TODO: add the fallacies link to the ones that has an article iunder category logic...
  const fallaciesData = {
    "الإحتجاج-من-الصمت": {
      title: "مغالطة الإحتجاج من الصمت",
      description:
        "هي الخطأ بالاعتقاد بأن عدم ذكر شيئ ما، يعني أنه لم يحدث. إن سٌخف هذا الأسلوب يمكن كشفه بسهولة عند التأمل في أن الكتاب المُقدَّس لم يصرِّح في أي موقع بأنَّ يوحنا المعمدان قد ”استخدم دورة المياه.“ لكن حقيقة كون هذا الأمر لم يُذكر لا يعني أنَّه لم يحدث أبداً! في بعض الأحيان سيقوم أحد كتاب الأناجيل بتسجيل تفصيل مُعيَّن في حين أنَّ كاتباً آخر يقوم بإغفال تسجيله. هذا ليس بتناقض! فالكتاب المختلفين يتخذون قرارات مختلفة فيما يتعلّق بما يقومون بتسجيله أو ما يقومون بالإغفال عنه. لكن حين يُغفِلون عن ذكر أمرٍ معين هذا لا يعني بأنَّه لم يحدث.",
      video: "",
    },
    "الإلتماس-العاطفي-للمطلوب": {
      title: "",
      description:
        "تحدث هذه المغالطة حين يقوم الشخص باستخدام لغة متحيّزة (وغالبا تكون مشحونة بعبارات عاطفيّة) في محاولة لدعم استنتاج لم يقم  بتقديم إثبات منطقيّ له. \n على سبيل المثال، إن قام أحد المراسلين الصحفيين بنقل خبر باسلوب يشبه التالي: ”لقد تم توجيه التهمة إلى المجرم بأنه قد قام بقتل الضحّية البريئة، وذلك بطريقة وحشية،“ سيكون هذا استخداما لالتماس السؤال العاطفي لأنه قد استخدم لغة متحيّزة ليقدّم قضيته علما أن القضية لم تحسم بعد. أما الطريقة الموضوعية لنقل الخبر ستكون ”لقد تمّ توجيه التهمة إلى المشتبه به بأنّه قد قتل شخصا آخر.“",
      video: "Fh8Gw6iJWqE",
    },
    "التعميم-واسع-النطاق": {
      title: "مغالطة التعميم واسع النطاق وغير الدقيق",
      description:
        "وهي فشل في ملاحظة كون بعض المبادئ التي وضعت بصفة عامة تمتلك بعض الاستثناءات. فسفر الأمثال هو خير مثال عن هذا التعميم - ان الأشياء المذكورة فيه هي صحيحة في معظم الظروف، ولكن يوجد بعض الإستثناءات. وهنا تحدث مغالطة التعميم غير الدقيق حين يتم الإفتراض بكون الاستثناءات هي تناقضات. إنَّه ليس بتناقض حين يتم تقديم تصريح بأنَّه ”في معظم الأحيان أ لكن أحياناً ليس أ.“  على سبيل المثال، إن الطلاق بشكل عام هو غير مقبول وبدقة أكبر هو غير مقبول إلا في حالة الخيانة. وبالتالي فإن ذلك ليس بتناقض بأن يتم التصريح بأن الطلاق هو مقبول (بمعنى أنَّه ليس خطيئةً) في حالة الزنى.",
      video: "U82pnIOYvBk",
    },
    "المغالطات-الرسمية": {
      title: "المغالطات الرسميّة",
      description:
        "إنّ المغالطات الرسمية تتعامل مع المنطق الرسمي الإستنباطي الذي سبق وأشرنا إليه في المقدمة وهو المنطق الذي يمكن التعبير عنه باستخدام الرموز عوضا عن الفروض. وهو ما يعرف بالقياس المنطقي حيث أننا ننتج صيغة رياضية قياسية صالحة للحكم على مدى صلاحية الجدلات المنطقية.",
      video: "cp05WnmDsUo",
    },
    "تحليل-النقل-النصّي": {
      title: "الفشل في اجراء تحليل للنقل النصي",
      description:
        "إن الفشل في اجراء تحليل للنقل النصي هو ما يعرف (بالنقد النصي) وهو علم تمييز النص الأصلي للنص المُقدَّس حيث أنه يوجد يوجد بعض الإختلافات فيما بين المخطوطات الأثرية للكتاب المقدس، وهذه الإحتلافات محدودة من حيث الكم ومن حيث النوعية. والمسيحيين يدَّعون بأن النص الأصلي للكتاب المقدس معصوم عن الخطأ كون الكُتَّاب كانوا مُساقين بالروح القُدُس وبالتالي لا يوجد فيه أية أخطاء أو تناقضات. نحن نعرف بأن عملية نسخ نص الكتاب المقدس عبر العصور ليست مثالية بشكل مطلق، ويوجد بعض الأخطاء النسخية التي تتسبب بوجود اختلافات طفيفة في بعض المخطوطات القديمة. ان هذه الإختلافات هي صغيرة جداً لكنها موجودة. في بعض الأحيان يلجأ الناقدون إلى الإشارة إلى هذه الأخطاء النسخية في المخطوطات المختلفة ويدَّعون بأن هذا يتناقض مع  نص آخر حيث لم يتم ارتكاب خطأ مشابه في النسخ. ولكن هذا لا يعتبر تناقض حقيقي في النص الأصلي للكتاب المُقدَّس. وحتى يتم قبول هذا الادعاء على أنَّه تناقض حقيقي يتوجب على الناقد أن يُظهِر أن هنالك دليل حقيقي على أن هذا ليس مجرد خطأ في نسخ نص المخطوطة الأصلية وبأنَّه يتناقض مع النص الأصلي. وهذا النوع من الأخطاء في النسخ ليس أمراً شائعاً كما يتم الترويج له.",
      video: "",
    },
    "مغالطة التشعُّب": {
      title: "مغالطة التشعّب (التقليص الخاطئ):",
      description:
        "وتعرف باسم مغالطة (إمّا أو). وتحدث هذه المغالطة حين يطالب الشخص بأن تكون الإجابة هي واحدة من بين إجابتين أو أكثر كان قد أعدها بشكل مسبق في حين أنَّ الحقيقة تكون في إجابة ثالثة لم يقم بتقديمها. كما في حالة ”إنَّ الإشارة الضوئية للمرور إما أن تكون حمراء أو خضراء“ فهي مغالطة تشعّب حيث أنّ الإشارة الضوئية قد تكون صفراء. ”إما أن يتبرر الإنسان بالأعمال أو بالإيمان“ وهذه مغالطة تشعّب أيضاً فالإنسان قد يتبرر بالإيمان أمام الله في حين أنَّه يتبرر بالأعمال أمام الناس.",
      video: "",
    },
    "مغالطة-التعميم-القطعي": {
      title: "مغالطة التعميم غير الدقيق / القطعي",
      description:
        "تحدث هذه المغالطة حين يتم تطبيق التعميم على الإستثناءات. إذ أن التصريحات العامة هي عامّة التطبيق ولكن ليس بشكل دائم. فهي صحيحة في حين يتم تطبيقها على معظم الأفراد في معظم الأحيان. إلا أنه يوجد استثناءات. \n مثلا ”رياضة الجري هي مفيدة لعضلة القلب. إن السيد (س) لديه مشكلة خاصة بالقلب، وبالتالي فإنه من المفترض أن يمارس الجري.“",
      video: "U82pnIOYvBk",
    },
    "مغالطة-الفروع": {
      title: "مغالطة الفروع",
      description:
        "وهي الخطأ في الإدّعاء بكون ”أ“ و ”ب“ هما متناقضين في حين أن ”أ“ هو فرع من ”ب“ أو العكس بحيث أن ”ب“ فرع من ”أ“ وبالتالي فإن كل من الحدثين هما متوافقين. على سبيل المثال إن ٥ هي فرع من ١٠ وبالتالي فإنَّ تصريحي بأنّ ”لدي خمسة أصابع“ لا يتناقض مع تصريحي  بأن لدي ”عشرة أصابع“ حيث أن خمسة أصابع انما هي فرع من عشرة . أي أن كل شخص لديه عشرة أصابع فهو بالضرورة يمتلك خمسة أصابع (بالإضافة إلى خمسة أصابع إضافيّة). في الحقيقة أنَّ مغالطة الفروع هي أحد أنواع مغالطات الإحتجاج من الصمت، فحقيقة كون أن أحد كُتَّاب الوحي المُقدَّس لم يقم بتسجيل حدث من الأحداث أو لم يذكر أحد الأشخاص في تسجيله عن الأحداث فذلك لا يعني أنه لم يحدث أو أنَّ الشخص لم يوجد. بالتالي، واحد من الكُتَّاب قد يُصرّح بأن يسوع قد شفى شخص لديه مسّ شيطاني في حين أن كاتباً آخر قد يسجل أنَّه قد شفى شخصين. وهذا ليس بتناقض فعلى اعتبار أن يسوع قد شفى شخصين فهو بالضرورة قد شفى شخصاً واحداً (بالإضافة إلى شخص آخر.) فالكاتب الأول لم يذكر الشخص الثاني لأي سبب من الأسباب (ربما يكون الشفاء الثاني أقلّ أهمية من أن يذكر)، لكن هذا لا يعني بأنَّه لم يحدث. أما لو أن الكاتب الأول قد صرَّح بأن يسوع قد قام بشفاء شخص واحدٍ فقط، والكاتب الثاني صرَّح بأن يسوع قام بشفاء شخصين في الوقت عينه وبالمعنى ذاته، حينها سيكون لدينا مشكلة تناقض. لكن لا يوجد أي مشكلة مشابهة لذلك في النصوص المقدسة.",
      video: "",
    },
    "مغالطة-المسبّبات-الخاطئة": {
      title: "مغالطة المسببات الخاطئة",
      description:
        "تحدث حين يعزو المجادل علاقة سببية خاطئة بين حدثين. فلمجرد أن الحدثين وقعا في الوقت عينه تقريبا فإن ذلك لا يعني بأنّ واحدهما قد سبب الآخر. فالأمر قد يكون مجرّد مصادفة، أو أنه يوجد مسبّب آخر للحدثين معا. ولربما يكون أكثر الأمثلة تكرارا هو القول بأن المسيحيّة تسببت بالعصور المظلمة المعروفة في أوروبا، أو أن اكتشاف التطور هو المسؤول عن التطور الطبي والتكنولوجي المعاصر. \n فوقوع الأمرين في وقت واحد قد يكون مجرّد مصادفة. والخرافات تصنف على أنها ارتكاب لهذه المغالطة. مثل السير أسفل السلم، الرقم ١٣، مرور قطة سوداء في دربك وما يتبع ذلك من أحداث ومصائب، هذه الأمور هي ارتكاب لمغالطة المسببات الخاطئة.",
      video: "PXO-HKB-VK8",
    },
    "مغالطة-المفارقة-التاريخيّة-للمعنى": {
      title: "مغالطة المفارقة التاريخيّة للمعنى",
      description:
        "وتحدث حين يقول الشخص باستدعاء معنى حديث للكلمة واستخدامه في قراءة النص في حين أنّ الكلمة لم تحمل ذلك المعنى في الوقت الذي كتبت به. فمثلاً قد يلجأ أحد الأشخاص إلى الإدّعاء بأنَّ الكتاب المقدس يدَّعي بوجود كائنات حية خارج الأرض، بسبب وجود العديد من التشريعات الكتابية التي تتضمن تعليمات تتعلق بال ”الغرباء“ (كما في سفر العدد ٩: ١٤، ١٥: ١٥). لكن المعنى المُراد من الكلمة هو غير الوطنيّين أي غير المقيمين في اسرائيل أو الأصلييّن، في حين أن تحوير المعنى ليشمل الغرباء بمعنى الكائنات الفضائية هو مغالطة (تحوير) للمعنى.",
      video: "",
    },
    "مغالطة-المواربة": {
      title: "مغالطة المواربة",
      description:
        "وتحدث حين يقوم الشخص بتغيير معنى كلمة معينة ضمن سياق جداله الذي يقدمه. على سبيل المثال: ”رسالة يعقوب ١: ٣ تُعلِّم بأنّ اللهَ غَيْرُ مُجَرَّبٍ، في حين أن الرسالة إلى العبرانيين ٤: ١٥ تعلم بأن يسوع المسيح (الإله) مُجَرَّبٌ فِي كُلِّ شَيْءٍ“ أليس هذا تناقضاً؟. لكن كلمة ”جُرِّبَ“ قد حملت معنيَين مُختلفَين في الآيتين فهي قد تعني ”اختُبِرَ“ (وهو المعنى المستخدم في الرسالة إلى العبرانيين ) أو قد تعني ”أُغويَ“ (وهو المعنى المستخدم في رسالة يعقوب). وهو ليس بتناقض أن يتم التأكيد بأن يسوع كان تحت الإختبار إلا أنَّه لم يُغوى. ",
      video: "",
    },
    "مغالطة-النطاق-الدلالي-لمعنى-الكلمة": {
      title: "مغالطة النطاق الدلالي لمعنى الكلمة",
      description:
        "تحدث هذه المغالطة حين يقوم القارئ بتحديد جميع المعاني التي قد تحملها الكلمة ثم بعد ذلك يقوم باختيار المعنى الذي يتناسب مع التفسير الذي يتبنّاه، عوضاً عن السماح لسياق النص أن يقوم بتحديد معناها، علماً أن سياق النص هو ما يقوم بتحديد المعنى وليس تفضيلات القارئ.",
      video: "",
    },
    "مغالطة-رجل-القش": {
      title: "مغالطة رجل القشّ",
      description:
        "تحدث مغالطة رجل القش حين يقوم الشخص بتشويه موقف الخصم ومن ثم يتابع في دحض ما سبق وقدّمه عوضاً عن التعامل مع الموقف الحقيقي للخصم. إن مغالطة رجل القش هي نوع خاص من مغالطة الفرضيات غير المترابطة حيث ان هذا النوع من المغالطات يعتمد على إثبات نقطة ليست موضوعة على طاولة الحوار. وفي حالة رجل القش يقوم الشخص بدحض الموقف الوهمي الذي قام بتقديمه وهذا الأمر لا صلة له بالموقف الحقيقي للخصم فهو قد قام بإنشاء كيان من قشّ وتابع باستعراض قوته أمامه. وهذا النوع من الأخطاء المنطقية يجب أن يتم تلافيه والحذر منه في الوقت ذاته.",
      video: "UiY9lZV2ycQ",
    },
    "منطق-مُخادع": {
      title: "المنطق المُخادِع",
      description:
        "وهو يحدث حين يقوم الناقد بقفزات غير منطقية وغير مترابطة في الاستنتاجات التي يقدمها. فلنفترض أن الناقد قام بالإدّعاء بأنَّ التصريح بكون ”أجَاج قد أُعدِمَ “يتناقض مع الإدّعاء بأنَّ ”أجَاجَ لديه ذُرّية أي نَسل.“ هذا سيكون مثالاً عن المنطق المُخادِع، وذلك لعدم وجود أي مُبرّر منطقي لرفض كون أجاج قد وَلَدَ بنين ثم بعد ذلك وفي وقتٍ لاحقٍ قد أُعدِمَ. فذرّيتَهُ لن تتلاشى لمجرَّد أنَّه قد مات.",
      video: "",
    },
    "مغالطة-التركيب": {
      title: "مغالطة التركيب (التعميم)",
      description:
        "تحدث حين يقوم الشخص بالجدل بطريقة مغلوطة مدّعيا أن مايصحّ على الجزء يجب أن يكون صحيحا على الكلّ، أو ما يصحّ على عدد من أفراد المجموعة هو صحيح على كامل المجموعة. \n في بعض الأحيان يكون ذلك صحيحا، لكن ذلك لا يعني أنه صحيح بشكل دائم؛ وبالتالي فإنه يتوجب علينا أن نقوم بفحص كل ادعاء بشكل منفصل.",
      video: "U82pnIOYvBk",
    },
    "قراءة-غير-دقيقة": {
      title: "القراءة غير الدقيقة والفشل في تحديد طبيعة النصّ",
      description:
        "القراءة غير الدقيقة للنصوص هو خطأ شائع يحدق حين يقوم الناقد بقراءة النصوص بطريقة سطحية ودون بذل أي مجهود لمحاولة فهم النصوص ضمن سياقها النصّي والتاريخي والأدبي. \n وهي فشل في قراءة النصّ بطريقة تتوافق مع الأسلوب الأدبي الذي كُتب به. فالكتاب المقدس يحتوي على عدة أساليب مختلفة في الكتابة مثل: التاريخ (التكوين، الخروج، الملوك)، الشعر (المزامير، نشيد الأنشاد، الأمثال)، النبوءات (حزقيال، رؤيا يوحنا اللاهوتي)، الأمثال (أمثال المسيح في الأناجيل). ولا يمكن أن يتم تفسيرها جميعاً بأسلوب واحد. فالشعر بالعادة يحتوي على الصور الأدبية والتعبيرات المجازية، في حين أن السرد التأريخي يقرأ بطريقة حرفية. ومن عدم الأمانة للنص أن يتم تفسير النص المكتوب بطريقة شعرية على أنه سرد تأريخي أو تفسير السرد التأريخي على أنه شِعر. فعلى سبيل المثال، حين يتسائل كاتب المزمور عن سبب عم إجابة الله للصلاة؟ لماذا ينام الرّب؟، لا يجب أن يتم أخذ معنى ”النوم“ في هذه الحالة على أنّه نوم حرفي وإلا يعتبر هذا تفسيراً غير واعياً للنص ويفتقر للأمانة. ولكننا نجد البعض من الناقدين يستعملون هذا النوع من الأخطاء كما في #٤٠٠. سوف نجد العديد من الأخطاء التي تُرتَكَب من قِبَل الناقدين والتي يمكن وصفها بكل بساطة على أنَّها ”فشل في قراءة النص بتأنٍّ وانتباه.“ حيث أنَّه وعلى ما يبدو أن الناقد قد قرأ النص بشكل معزول وخارج سياقه، الأمر الذي قاده إلى الخروج بتفسير لا يمكن للقارئ الحذر أن يخرج به. فإنه سيكون من السُّخف القول بأنَّ ”الكتاب المُقدَّس يقول بأنَّه ليس إله من المزمور ١٤: ١“ ذلك أنَّ سياق الآية يقول بأنَّ ” قَالَ ٱلْجَاهِلُ فِي قَلْبِهِ: «لَيْسَ إِلَهٌ».“ بالرغم من وضوح الأمر إلا أننا نجد عدداً من النُّقاد يسقطون في أخطا. إن بعض الأخطاء التي يرتكبها الناقدين لا يمكن أن يتمّ وصفها إلا بأنَّها ”خداع.“، وهي تلك الحالات التي لا يوجد أي نوع من التناقض الظاهري بين الآيات. وإنَّ أي شخص عقلاني سيلاحظ ذلك حتى من القراءة الأولى للنص، بالرغم من ذلك نجد أنّ هذا النوع من التناقضات المفترضة مُدرَج على لوائح تناقضات الكتاب المُقدَّس، التي يمكننا أن نقول عنها بأنها لوائح مُخادعة قام بوضعها النقّاد آملين في أنَّها سُتبهر من يطَّلع عليها فلا يقوم بمراجعتها. وللأسف هذا ما يحدث في كثير من الحالات.",
      video: "",
    },
  };
  return (
    <>
      <hr />
      <div>
        <h3>الأخطاء المنطقية المُستخدمة في هذا الإعتراض:</h3>
        {article.fallacies.map((fallacy, index) => (
          <div key={index}>
            <h4>{fallaciesData[fallacy].title}</h4>
            <p>{fallaciesData[fallacy].description}</p>
            {fallaciesData[fallacy].video && (
              <div className="container-md">
                <div className="row justify-content-center">
                  {fallaciesData[fallacy].video && (
                    <div
                      className={`${
                        article.youtube ? "col-md-7" : "col"
                      } m-p-3`}
                    >
                      {/* <YouTubeEmbed video={article.youtube} /> */}
                      <YouTube
                        videoId={fallaciesData[fallacy].video}
                        opts={opts}
                      />
                    </div>
                  )}
                </div>
              </div>
            )}
          </div>
        ))}
      </div>
    </>
  );
}
