import PageTitle from "../components/general-compenents/page-title";
import YouTubeEmbed from "../components/iframes/youtube-component";
import ShareIt from "../components/ui/share-it";
import BibleVerseHero from "../components/ui/bible-verse-hero";

export default function TheGospelPage() {
  return (
    <>
      <PageTitle
        title="الإنجيل - البشرى السّارة"
        description="كامل غضب الله الذي استحقه شعبه قد انسكب بتمامه على ابنه يسوع. لقد أصبح بذلك يسوع الكفّارة لخطايانا."
        image="/blog-images/art-2092530_1920.jpg"
      />
      <ShareIt url="/gospel" />
      <section>
        <div
          style={{
            display: "flex",
            justifyContent: "center",
            alignItems: "center",
            // height: "100vh",
          }}
        >
          <YouTubeEmbed video="98IhK5V53ks" />
        </div>
      </section>
      <section>
        <BibleVerseHero
          body="إِنْ مَاتَ رَجُلٌ أَفَيَحْيَا؟"
          reference="أيوب ١٤: ١٤"
          translation="ترجمة كتاب الحياة"
        />
        <h2>أهم أسئلة الحياة المصيرية</h2>
        <p>
          إن هذا السؤال هو ما قام بطرحه الرجل الذي يحمل اسمه أحد أقدم أسفار
          الكتاب المقدس (
          <a
            href="https://my.bible.com/bible/101/JOB.14.14.keh"
            target="_blank"
          >
            أيوب ١٤: ١٤
          </a>
          ). فالموت هو المصير الذي سوف يواجهه الجميع في يوم من الأيام (
          <a href="https://my.bible.com/bible/101/HEB.9.27.keh" target="_blank">
            العبرانيين ٩: ٢٧
          </a>
          ). يعلم جميع الأشخاص بشكل غريزي أنَّ موت أجسادنا المادية ليس نهاية
          وجودنا (
          <a href="https://my.bible.com/bible/101/ecc.3.11.keh" target="_blank">
            الجامعة ٣: ١١
          </a>
          ). حتى إن الشخص الذي يدّعي الإلحاد يعرف ذلك. ربما قد يقول الملحد
          بأنَّه لا يؤمن بالله، إلا أنَّه عندما يُلقي برأسه على الوسادة مساءاً
          ويبدأ بالتأمل في الأسئلة العميقة التي تدور في ذهنه، فإنَّه يُدرك في
          قرارة نفسه بوجود خالق. إنَّه يعرف الحق، ولكنَّه يكتم الحق بالإثم (
          <a
            href="https://my.bible.com/bible/101/ROM.1.18-20.keh"
            target="_blank"
          >
            رومية ١: ١٨
          </a>
          )
        </p>
        <p>
          ما هو العامل الذي يُحدّد أين نقضي الأبدية حين يأتي موعد لقائنا مع
          الموت؟ يمتلك معظم الأشخاص فكرة غامضة تُفيد بأنَّ تَفُوُّق أعمالهم
          الصالحة على السيئة منها سيدفع بالله إلى أن يسمح لهم بأن يدخلوا إلى
          الفردوس. نحن نعتقد بأننا أشخاص صالحين لأننا نميل إلى تقييم صلاحنا من
          خلال مقارنة أنفسنا مع الآخرين. إذا قارنت نفسي بصدام حسين أو أدولف هتلر
          أو بينيتو موسوليني أو جوزيف ستالين أو بول بوت، فأنا شخص صالح جداً. أنا
          لم أفعل أبداً أياً من تلك الأشياء. إلا أنَّه يوجد أخبار سيئة. إنها
          أخبار سيئة للغاية.
        </p>
        <h2>حقيقة الأخبار السيئة</h2>
        <p>
          إن الله لا يُقيّم صلاحنا من خلال مقارنتنا مع الأشخاص الآخرين. إنَّه
          يقوم بتقييم صلاحنا من خلال مقارنتا بنفسه. وعند المقارنة مع الله، فإنَّ
          الأمر الأكيد هو أنَّه لن يوجد أي شخص بارّ. جميعنا قُمنا بكسر القواعد
          الأخلاقية الإلهية. جميعنا قُلنا الأكاذيب، نحن كاذبون. تقريباً كلٌّ منا
          قام بسرقة أمر ما، نحن لصوص. جميعنا قمنا باستعمال اسم الله باطلاً، نحن
          مُجَدِّفون. لقد نظرنا إلى الآخرين نظرة شهوة جسدية، نحن زُناة في قلوبنا
          (
          <a
            href="https://my.bible.com/bible/101/MAT.5.27-28.keh"
            target="_blank"
          >
            متى ٥: ٢٨
          </a>
          ). جميعنا خُطاة (
          <a href="https://my.bible.com/bible/101/ROM.3.23.keh" target="_blank">
            رومية ٣: ٢٣
          </a>
          ). جميعنا مُتمرّدون (
          <a href="https://my.bible.com/bible/101/ISA.53.6.keh" target="_blank">
            اشعياء ١: ٢٨
          </a>
          ). إن خطايانا لن تُبعدنا فقط عن الله (كولوسي ١: ٢١)، بل ستجعل منا
          أعداء له (
          <a href="https://my.bible.com/bible/101/ROM.5.10.keh" target="_blank">
            رومية ٥: ١٠
          </a>
          )
        </p>
        <p>
          حين نقوم بمخالفة القوانين الأرضية فإنه يوجد عقوبة يتوجب تأديتها. حين
          نقوم بمخالفة القوانين الإلهية، يوجد أيضاً عقوبة يتوجب تأديتها؛ إن
          العقوبة المترتبة على مخالفة القوانين الأرضية هي عقوبة مؤقتة، ولكن
          العقوبة المترتبة على مخالفة القوانين الإلهية هي أبدية لأن الله سرمديّ.
        </p>
        <p>
          يعترض البعض قائلين: ”ولكن الله هو إله صالح!“ ويؤكدون قائلين: ”الإله
          الصالح سوف لن يقوم بإرسال أيّ شخص إلى الجحيم“. إن صلاح الله ليس ضمانة
          للخاطئ بأنَّه سوف يُخَلَّص، بل بالحري هو ضمانة بأنَّ العدل سوف يتحقق.
          إن الله هو صالح. حقيقة الأمر هي أنَّه وحده الصالح بطبيعته (
          <a href="https://my.bible.com/bible/101/MRK.10.18" target="_blank">
            مرقس ١٠: ١٨
          </a>
          )، ولابد من أن يُدين الخطيئة، ذلك أنَّه إن لم يُدين الخطيئة فإنَّه لن
          يكون صالحاً.
        </p>
        <p>
          فلنفترض بأنَّ رجلاً قد ارتكب جريمة قتل ثُبِّتَت من خلالة كاميرا
          مراقبة. وعند القبض على الرجل، عُثر على سلاح الجريمة وبصمات أصابع
          المُتَّهم في كلّ مكان. شَهِدَ العديد من شهود العيان على أنَّه القاتل.
          وبالتالي فإنَّ المشتبه به قد وُجِدَ مُذنباً في المحكمة. إنها قضية
          واضحة.
        </p>
        <p>
          يقول القاضي للمجرم المُدان: ”لقد تمت إدانتك للتو بارتكاب جريمة قتل. هل
          لديك ما تقوله قبل أن أُقرّر الحُكم والعقوبة؟“ يرد القاتل المُدان:
          ”حسناً أيها القاضي، أعتقد أنك قاضٍ صالح. ولأنَّك قاضٍ صالح، أعتقد أنه
          يجب عليك أن تسمح لي بالمغادرة. إن الأمر هو أنني قمت فقط بارتكاب جريمة
          قتل واحدةٍ في يوم واحد. إنني وفي جميع أيامي الأُخرى لم أقتل أي شخص
          أبداً“.
        </p>
        <p>
          ماذا لو أن القاضي أجاب قائلاً: ”أعتقد أنَّك على حقّ. أنا قاضٍ صالح،
          ولذلك فإنني سوف أسمح لك بالمغادة. أنت حرٌّ بالذهاب. أتمنى لك يوماً
          سعيداً.“ فيخرج القاتل المُدان من قاعة المحكمة كرجل حُرّ.
        </p>
        <p>
          هل سيكون ذلك القاضي صالحاً؟ لا! إن ذلك سيكون قاضٍ سيء للغاية، لأنَّ
          القاضي الصالح سوف يقوم بتطبيق العقوبة على المجرم من أجل جريمته. إن
          الله هو القاضي الصالح المطلق ولابد من أن يُدين الخطيئة. فإن لم يُدِن
          الخطيئة فإنَّه لن يكون قاضٍ صالح. إن الكثير من الأشخاص يعتمدون على
          صلاح الله ليغفر لهم خطاياهم، لكن صلاح الله هو ما سيحتم مصيرهم.
        </p>
        <p>
          ولكن ماذا عن محبة الله؟ إن الكتاب المقدس يُعلمنا بشكل واضح أن الله
          محبة (
          <a href="https://my.bible.com/bible/101/1JN.4.8" target="_blank">
            يوحنا الأولى ٤: ٨،
          </a>
          <a href="https://my.bible.com/bible/101/1JN.4.16" target="_blank">
            ١٦
          </a>
          ). فكيف للإله المُحب أن يُرسل الناس إلى الجحيم؟ إن هذا السؤال هو من
          الأسئلة المُتكرّرة.
        </p>
        <p>
          إن هذا السؤال يحتوي على نوع من التضليل وذلك لأنَّه يُلمِّح إلى أن الله
          يقوم بشكل فاعل بمعاقبة أشخاص ليسوا أكثر من مشاركين سلبيّين. إلا أن
          الحقيقة مختلفة عن ذلك. إن الأشخاص الذين يُرسلهم الله إلى الجحيم
          موجودون هناك نتيجة لحياة الخطيئة والتمرد على الله. علاوة على ذلك، إن
          محبة الله ليست محبة مُلاطفة وغُنجْ. إنَّ محبته هي محبة مُقدَّسة
          وعادلة.
        </p>
        <p>
          إن واقع الحال يُظهر لنا بشكل جليّ كيف أنَّ محبة الله هي ظاهرة من خلال
          إعطاءه لنا ما لا نستحقه. تقول رسالة رومية ٥: ٨ ”وَلَكِنَّ اللهَ
          أَثْبَتَ لَنَا مَحَبَّتَهُ، إِذْ وَنَحْنُ مَازِلْنَا خَاطِئِينَ مَاتَ
          الْمَسِيحُ عِوَضاً عَنَّا.“ تتجلى محبة الله في أننا وعلى الرغم من أننا
          ونحن خطاة متمرّدين عليه وغير مستحقين لأي شيء عدا عن غضبه، فإنَّه قد
          أرسل ابنه الوحيد ليموت نيابة عنا. هذا هو التعبير ما قبل الأخير عن
          المحبة.
        </p>
        <p>
          إن الشخص الذي يموت في الخطيئة، فإنَّ نهايته العادلة والمُحقّة ستكون في
          المكان الحقيقيّ الذي يدعوه الكتاب المقدس الجحيم. وعنا يجب علينا ألا
          نتهاون مع الجحيم، إذ يوجد الكثير من الواعظين الذي يقولون أنَّ الإنسان
          الذي يموت في خطيئته سينفصل عن الله إلى الأبد. لكن هذا الأمر ليس صحيح
          بشكل كامل. إن الأمر الأكثر رُعباً فيما يختص بالجحيم هو … الله نفسه. إذ
          أنَّ الله موجود هناك، وهو موجود بكامل غضبه. وبحسب ما نقرأ في
          <a href="https://my.bible.com/bible/101/REV.14.9-11" target="_blank">
            سفر الرؤيا ١٤: ٩-١١
          </a>
          ، فإنَّ جميع الذين تتم إدانتهم ”…لابُدَّ لَهُمْ، فِي حَضْرَةِ
          الْمَلائِكَةِ الْقِدِّيسِينَ وَفِي حَضْرَةِ الْحَمَلِ، أَنْ يَشْرَبُوا
          مِنْ خَمْرِ الْغَضَبِ غَيْرِ الْمُخَفَّفَةِ، الْمَسْكُوبَةِ فِي كَأْسِ
          غَضَبِ اللهِ، فَيُكَابِدُوا عَذَابَ النَّارِ وَالْكِبْرِيتِ
          الْمُتَّقِدِ، وَيَتَصَاعَدُ دُخَانُ عَذَابِهِمْ إِلَى أَبَدِ
          الآبِدِينَ.“
        </p>
        <p>
          إن انفصال أولئك الذين في الجحيم عن الله هو انفصال في العلاقة. هذا هو
          الأمر الذي تشير إليه الآيات الواردة في رسالة تسالونيكي الثانية ١: ٨-٩.
          لن يوجد علاقة بين الله وبين أولئك المُدانين. لن يوجد شراكة. لن يوجد
          حُب متبادل. لكن من الناحية القضائية، فإن الأشخاص الذي في الجحيم سوف
          يكونون في حضرة الله إلى الأبد حيث ”حَيْثُ دُودُهُمْ لَا يَمُوتُ،
          وَالنَّارُ لَا تُطْفَأُ.“ (مرقس ٩: ٤٨) إن الأمر الأكثر إثارة للرعب
          بخصوص الجحيم هو وجود الله في كامل غضبه هناك.
        </p>
        <p>
          هذه هي الأخبار السيئة. هذا هو ما تستحقّه أنت وما أستحقه أنا. هذا ما
          تحصّلنا عليه من خلال خطايانا المتعمدة. إن أجرة الخطيئة هي موت (رومية
          ٦: ٢٣). لا يُمكن لأي مقدار من الأعمال الصالحة أن يُرضي غضب الله
          المستعر ضد خطايانا. إن الكتاب المقدس يقول أن أعمالنا هي ”كَثَوْبٍ
          قَذِر“ (اشعياء ٦٤: ٦) وذلك أمام إله قدّوس قدّوس قدوس (اشعياء ٦: ٣؛
          الرؤيا ٤: ٨). إن أعمالنا الصالحة لن تكون ذات فائدة لنا في يوم
          الدينونة.
        </p>
        <p>إن السؤال هو التالي:</p>
        <p>
          كيف يُمكن للإله القدوس والعادل أن يقوم بمسامحة الخُطاة دون أن يتنازل
          عن صلاحه وعدله؟
        </p>
        ولكن يوجد أخبار سارّة.
        <p></p>
      </section>
      <section>
        <h2>ماهو سبب كون الأخبار السارّة سارّةً جداً</h2>
        <p>إليك الأخبار السارّة: إن الله يُحبك.</p>
        <p>
          لقد أعدَّ الله طريقا لك وذلك من خلال نعمته وحدها – وهو الطريق الوحيد،
          في الحقيقة – ذلك للنجاة من غضبه. لقد أعدَّ طريقاً لنا نحن أعداءه
          (رومية ٥: ١٠) لكي نتصالح معه. لقد أرسل ابنه يسوع المسيح إلى عالمنا.
          لقد كان ومازال إلهاً كاملاً وإنساناً كاملاً. إنّه شخص واحد بطبيعتين:
          طبيعة ناسوتية (بشرية) وطبيعة لاهوتية. إنَّه الإله المتجسد.
        </p>
        <p>
          لقد وبَّخ يسوع المعلمين الكذبة والأنظمة الدينية الكاذبة، لقد شفى
          المرضى، طرد الأرواح النجسة والشياطين، أقام الأموات، صنع معجزات، وبشّر
          بالإنجيل. لقد عاش حياة في طاعة مثالية لله الآب. ومن ثمَّ، بكامل
          إرادته، بذل حياته على خشبه الصليب. إنَّ حياته لم تُسلَب منه، لقد كان
          هو من بذلها (يوحنا ١٠: ١٨).
        </p>
        <p>
          كامل غضب الله الذي استحقه شعبه قد انسكب بتمامه على ابنه يسوع. لقد أصبح
          بذلك يسوع الكفّارة لخطايانا.
        </p>
        <p>
          وَفِي هَذَا نَرَى الْمَحَبَّةَ الْحَقِيقِيَّةَ، لَا مَحَبَّتَنَا
          نَحْنُ لِلهِ، بَلْ مَحَبَّتَهُ هُوَ لَنَا. فَبِدَافِعِ مَحَبَّتِهِ،
          أَرْسَلَ ابْنَهُ كَفَّارَةً لِخَطَايَانَا. (يوحنا الأولى ٤: ١٠).
        </p>
        <p>
          الكفارة هي ”الإسترضاء“ أو ”التسكين والإرضاء“. إن يسوع كان قد أرضى غضب
          الله من خلال تقديم نفسه كذبيحة نهائية عن الخطيئة. هناك على خشبة الصليب
          حُسِبَت خطايانا للمسيح. يقول الكتاب المقدس في رسالة كورنثوس الثانية ٥:
          ٢١ ”فَإِنَّ الَّذِي لَمْ يَعْرِفْ خَطِيئَةً، جَعَلَهُ اللهُ خَطِيئَةً
          لأَجْلِنَا، لِنَصِيرَ نَحْنُ بِرَّ اللهِ فِيهِ.“ لم يصبح يسوع المسيح
          خطيئة وفق المعنى الحرفي، بل بالحري جُعِلَ قرباناً وكفارة من اجل
          الخطيئة (رومية ٨: ٣). إن العقوبة التي نستحقها أنا وأنت قد طبَّقها الله
          على ابنه. إن الله قد عاقب يسوع نيابةً عن معاقبتنا. (اشعياء ٥٣: ١٠). إن
          يسوع قد مات على خشبة الصليب ومن ثمَّ في اليوم الثالث قام بالجسد من بين
          الأموات (متى ٢٨؛ مرقس ١٦؛ لوقا ٢٤؛ ويوحنا ٢٠)، ليُثبِتَ بذلك بأنَّه
          كان بالحقيقة الشخص الذي ادّعاه، الإله الذي اتخذ طبيعتنا البشرية.
        </p>
        <p>
          نحن لا نمتلك الصلاح من ذواتنا، وذلك لأننا أموات في الخطيئة (أفسس ٢:
          ١-٣) ولأننا عاجزون (رومية ٣: ١٠-١٢). لابد لنا من الحصول على صلاح شخص
          آخر. لابد لنا من الحصول على صلاح يسوع المسيح. وفق ذات الطريقة التي
          حُسِبَت خطايانا للمسيح، لابد من أن يُحسب بِرّه لنا، لا يُمكن لنا
          التحصّل على برّه من خلال شراءه باستخدام ثوب أعمالنا القذر.
        </p>
        <p>
          السؤال هو: إذا كان البرّ الكامل مطلوباً للحصول على الحياة الأبدية،
          فكيف نحصل على الحياة الأبدية إذا كنَّا مذنبين؟
        </p>
        <p>
          الإجابة هي: إن الله يهب الإيمان للمؤمنين ويحسب لهم إيمانهم كبرّ وذلك
          من خلال نعمة التجديد.
        </p>
        <p>
          يقوم روح الله القدوس بتبكيتنا على الخطيئة والبر والدينونة (يوحنا ١٦:
          ٨) ويهب الإيمان بالمسيح (أفسس ٢: ٨-٩؛ فيليبي ١: ٢٩) والتوبة عن الخطايا
          (تيموثاوس الثانية ٢: ٢٤-٢٦)
        </p>
        <p>
          يجب علينا أن نتخلى عن الإتكال على أعمالنا الصالحة ونضع إيماننا الكامل
          وثقتنا في العمل الذي أتمَّه يسوع المسيح على خشبة الصليب. يجب علينا أن
          نضع ثقتنا بيسوع وحده وأن نتوب عن خطايانا.
        </p>
      </section>
      <section>
        <h2>تُب وآمن.</h2>
        <p>
          لكن ما هو المقصود بالتوبة؟ إن معظم الأشخاص يعتقدون أنَّ التوبة هي مجرد
          رغبة المرء أن يتراجع عن خطايا معينة. لكن هذه التوبة ليست هي التوبة
          التي يطالب بها الكتاب المقدس. إن المصطلح اليوناني للتوبة هو
          (μετάνοια-مِيتْآنُوْيَا) وهو يحمل معنى حرفي مباشر بتغيير المرء لرأيه.
          نجد أن الكثير من الأشخاص يُعلمون أنه من أجل التوبة يجب على المرء أن
          يقوم ببساطة بتغيير رأيه حيال الخطيئة. بمعنى آخر، الإعتراف بالخطيئة على
          أنها خطيئة، وهذا يُشكِّل توبة. لكن هذا الأمر هو حقيقة جزئيّة، والحقائق
          الجزئية لن تكون فعّالة حين يتعلق الأمر بالقضايا الأبدية.
        </p>
        <p>
          إن التوية الحقيقيّة تأتي حين يهب الله التوبة (أعمال الرسل ٥: ٣٠-٣١؛
          ١١: ١٧) وعندما يتم مَنح هذه التوبة، تتغير أذهاننا بشكل فعلي، ومعها
          يتغير كل شيءٍ يختص بنا. تتغير رغباتنا. تتغير عواطفنا. نبدأ في محبة ما
          يحبه الله ونكره ما يكرهه. والتوبة الحقيقيّة تودي بشكل دائم إلى ثمار
          حقيقيّة ملموسة (متى ٣: ٨؛ أعمال الرسل ٢٦: ٢٠).
        </p>
        <p>
          إن لم يتواجد توبة حقيقيّة فإنَّه لا يتواجد اهتداء حقيقيّ (لوقا ١٣: ٣).
          وبالتالي فإنَّه لا يوجد خلاص. وإن كنت تشعر بالحيرة حيال ما إذا كنت قد
          تبت بالحقيقة أم لا، فإنه يتوجب عليك أن تتبع تعليمات الرسول بولس في
          رسالة كورنثوس الثانية ١٣: ٥ لتختبر نفسك لترى ما إذا كُنتَ في الإيمان.
          تأمل في حياتك واسأل نفسك الأسئلة التالية:
        </p>
        <ul>
          <li> هل أثق حقاً بالمسيح وحده من أجل خلاصي؟</li>
          <li>هل حدثت تغيّرات في حياتي؟</li>
          <li>هل أُحِبُّ ما يُحِبَّه الله؟</li>
          <li>هل أكره ما يكرهه الله؟</li>
          <li>هل أجوع إلى كلمته؟</li>
          <li>هل أُحِبُّ الأُخوة؟</li>
          <li>هل أقف مع المسيح في وجه الإضطهاد؟</li>
          <li>هل يوجد نمط متصاعد من القداسة في حياتي؟</li>
          <li>هل أحزن بسبب خطاياي؟</li>
        </ul>
        <p>
          {" "}
          ربما سيكون من المفيد أن يتم الإستفاضة في السؤال الأخير وذلك كون الحزن
          على الخطيئة هو أحد السمات المميزة للمسيحيّين. إن الكتاب المقدس يتحدث
          عن نوعين من الحزن على الخطيئة: حزن العالم والحزن الذي يوافق مشيئة الله
          (كورنثوس الثانية ٧: ٩-١٠). إن حزن العالم يؤدي إلى الموت، ولكن ما هو
          حزن العالم؟
        </p>
        <p>
          إن حزن العالم (الدنيوي) هو ذلك الحزن الذي يكون موجّهاً بشكل أُفقي.
          بمعنى آخر، هو الحزن الذي يتمحور حول أنفسنا. إنَّه ذلك الحزن الذي
          يتساءل: ”ماذا سيحدث لي إن كُشِفَت خطاياي؟ ماذا ستكون العواقب المترتبة
          عليّ؟“ إن الحزن الدنيوي هو الحزن الذي يهدف إلى اخفاء خطايانا لأننا لا
          نريد مواجهة عواقبها. إن الشخص الذي يمتلك الحزن الدنيوي على الخطيئة سوف
          يعود بشكل مباشر إلى تلك الخطيئة في حال استطاع أن يُفلِتَ من العقوبة
          دون أن يُكتَشَف. إن هذا النوع من الحزن سوف يؤدي إلى الموت، إلى الموت
          الأبدي.
        </p>
        <p>
          إلا أنَّ يوجد حزن على الخطيئة ولكنه من نوع آخر، وهو الحزن الموافق
          مشيئة الله. ينتج عن هذا النوع من الحزن ”تَوْبَةً تُؤَدِّي إِلَى
          الْخَلاصِ، وَلَيْسَ عَلَيْهِ نَدَمٌ“ (الآية العاشرة). إن الحزن الذي
          يوافق المشيئة الإلهية هو ذلك الحزن الذي يتم توجيهه بشكل عمودي. أي أنَّ
          الحزن الإلهي ليس موجهاً نحو أنفسنا، بل نحو الله. إن الحزن الموافق
          للمشيئة الإلهية هو الذي يحدث حين نحزن نتيجةً لخطايانا لأننا نُدرِك أن
          خطايانا تُحزِن الله (أفسس ٤: ٣٠) وأننا لا نُريد أن نُحزِنَه.
        </p>
        <p>
          إن الله هو صالح جداً ولطيف وكريم ورحيم جداً في تعامله معنا. إلا أننا
          أخطأنا تجاهه. لقد قمنا باحتقار العطايا الحسنة التي منحنا إياها. لقد
          قمنا باستغلال صبره ولطفه. لقد تصرّفنا جميعنا بأنانية. لقد استهزأنا
          بقداسته. وعلى الرغم من ذلك فإننا ”وَنَحْنُ مَازِلْنَا خَاطِئِينَ مَاتَ
          الْمَسِيحُ عِوَضاً عَنَّا.“ (رومية ٥: ٨)
        </p>
        <p>
          إن هذا التصريح هو تصريح مثير للدهشة. إن الله قد قدَّم ابنه الوحيد
          (يوحنا ٣: ١٦) الذي لم يرتكب أيّة خطيئة، وهو الذي يُحبّه محبةً غير
          محدودة ليكون ذبيحةً من أجلنا. فقط في صليب المسيح يُمكننا أن نرى مقدار
          كُره الله للخطيئة ومقدار محبته لنا. ونحن حين نُخطئ نُحزِنَ الله – وهذا
          الأمر يجب أن يُحزننا.
        </p>
        <p>
          أرجو ألا تقوموا بإساءة فهم الكلمات السابقةعلى أساس أنها تقول أن
          المسيحيّين لا يستطيعوا أن يُخطئوا. يُمكِن للمسيحيّين أن يرتكبوا
          الخطايا. فالمسيحيّ قد يتعثّر في الخطيئة، لكنه لا يُبحر في الخطيئة.
          المسيحيّ الحقيقيّ لا يستمتع بالخطيئة، ولا يبحث عن فرصٍ لارتكاب
          الخطايا. أما حين يُخطئ، فإنَّه يحزن بسبب خطيئته. وكما يجب نُريد الحصول
          على مُخلِّصٍ من الجحيم الأبدي، يجب أن نريد أيضاً مُخلصاً من الخطيئة.
          إذ أنَّ الإنسان الذي يريد مُخلصّاً من الجحيم ولكنَّه لا يريد مُخلصاً
          من الخطيئة، لن يكون لديه مخلص من أيّ منهما.
        </p>
        <p>
          إن لم تكن على ثقة من المكان الذي ستقضي فيه أبديتك في حال وفاتك اليوم،
          أرجو منك بل أترجّاك أن تكون صادقاً أمام الله. اعترف له بخطاياك. اعترف
          له بحاجتك المطلقة إلى رحمته ومغفرته. اطلب منه أن يُخلِّصَك. تُب عن
          خطاياك وضع ثقتك بيسوع المسيح. إن أتيت إليه حاملاً الحزن الموافق
          للمشيئة الإلهية على الخطيئة وبرغبة حقيقيّة لاتباعه من خلال الطاعة
          الكاملة له طوال حياتك، فإنَّه سيخلّصك، وسوف تنتقل من الموت إلى الحياة
          (يوحنا ٥: ٢٥). سوف يعبر عنك غضب الله، وتُغفر لك خطاياك وتُبعَدُ عنك
          كَبُعدِ الشرق عن الغرب (مزمور ١٠٣: ١٢) ولن يذكرها لك الله فيما بعد
          (العبرانيين ٨: ١٢)
        </p>
        <p>
          ”… كُلَّ مَا يَهَبُهُ الآبُ لِي سَيَأْتِي إِلَيَّ، وَمَنْ يَأْتِ
          إِلَيَّ لَا أَطْرَحْهُ إِلَى الْخَارِجِ أَبَداً،“ (يوحنا ٦: ٣٧) أليس
          هذا الوعد مُثيراً للعجب؟ إن أتيت إلى المسيح خالي الوفاض، طالباً مغفرة
          خطاياك، فإنَّه لن يردَّك خائباً بل سوف يُخلّصك. إن الدليل على اهتدائك
          وحياتك الجديدة في المسيح هو عُمرٌ من الطاعة واحضار ثمار جيّدة لمجده.
        </p>
      </section>
      <section>
        <h2>لقد وضعت ثقتي بالمسيح، ماذا أفعل الآن؟</h2>
        <p>
          إن كُنتَ قد وضعت ثقتك في يسوع المسيح كربٍّ ومُخلِّصٍ لحياتك، فأنت الآن
          بحاجة للعثور على كنيسة تتبنى التعليم العقائدي السليم، وإن كنت بحاجة
          إلى المساعدة في العثور على كنيسة جيّدة، لا تتردَّد في الإتصال بنا –
          ربما قد نكون قادرين على مساعدتك في العثور على كنيسة سليمة عقائدياً في
          منطقتك. إن هذا الأمر ضروري جداً، فأنت بحاجة إلى التواجد ضمن كنيسة
          جيّدة حيث ستسمع كلمة الله التي يعظ بها رجال مؤهلين للكرازة تأهيلاً
          كتاباً. أنت بحاجة إلى أن تتم تغذيتك، وتشجيعك، كما تحتاج إلى الرعاية
          والمساءلة، وتحتاج كذلك إلى مكان للخدمة وإلى الشراكة مع الأخوة والأخوات
          من ذوي الفكر المسيحي المماثل.
        </p>
        <p>
          يعتقد الكثير من الأشخاص ان الإهتداء إلى المسيحية سوف يجعل حياتهم أفضل.
          إن الحياة سوف تكون أفضل، ولكن من الضروري أن تكون وفق المعنى الذي
          يتبناه فيه معظم الناس حين يُفكرون بـ ”الحياة الأفضل“. إن حياتك في
          المسيح ستكون ”أفضل“ من حيث أنها ستكون مليئة بالفرح والنعمة التي لا
          يُمكن أن تأتي إلا من خلال عيش حياة الطاعة للمسيح. إلا أن حياتك في
          المسيح لن تكون ”أفضل“ بمعنى أنها ستصبح أسهل.
        </p>
        <p>
          بخلاف ما يحاول الكثير من المُبشّرين والأفلام”المسيحية“ أن يجعلوك
          تعتقد، إن الله لا يعدك بالحصول على محفظة مليئة بالأموال أو على جسمٍ
          صحيّ سليم. إنَّه لا يعدك بالحصول على سيارة جديدة أو منزل فاخر أو ترقية
          وظيفية. إن حياتك في المسيح ليست على وشك أن تُصبح أسهل. في الحقيقة إن
          الأمور على وشك أن تصبح أكثر صعوبةً إلى درجة كبيرة. إن الكتاب المقدس
          يقول لنا ”إِنَّ جَمِيعَ الَّذِينَ يَعْزِمُونَ أَنْ يَعِيشُوا عِيشَةَ
          التَّقْوَى فِي الْمَسِيحِ يَسُوعَ يُضْطَهَدُونَ.“ (تيموثاوس الثانية ٣:
          ١٢). لا يوجد استثناءات لهذه الآية. إن كنت ترغب حقاً في أن تحيا بالتقوى
          في المسيح يسوع، فسوف تواجه الإضطهاد. لذلك يجب أن تكون مستعداً لذلك،
          إنَّه قادم. وربما قد يأتيك من أفراد عائلتك (متى ١٠: ٣٥-٣٦). ولكنك الآن
          مؤهَّل للتعامل مع الأمر بنعمة وبطريقة تُكرم من خلالها ملكك (فيليبي ١:
          ٢٩) فأنت الآن مكان سُكنى روح الله القدوس الذي سيخلق فيك الرغبة بقراءة
          وفهم وإطاعة كلمة الله. في هذا سوف ”تزْدَاد نُمُوّاً فِي النِّعْمَةِ
          وَفِي مَعْرِفَةِ رَبِّنَا وَمُخَلِّصِنَا يَسُوعَ الْمَسِيحِ.“ (بطرس
          الثانية ٣: ١٨). لديك الآن علاقة الشركة مع القديسين (أعمال الرسل ٢: ٤٢؛
          العبرانيين ١٠: ٢٥؛ كولوسي ٣: ١٦)، إنهم أخوتك وأخواتك في المسيح، الذين
          ينتشرون في جميع أصقاع المعمورة (متى ١٢: ٤٦-٥٠). أنت لست وحيداً فيما
          بعد.
        </p>
        <p>
          حاول اقتناء كتاب مقدس دراسي، وننصح شخصياً باقتناء الكتاب المقدس
          الدراسي لجون ماك-آرثر – سواء كان بترجمة البستاني-ڤاندايك أو بأي ترجمة
          أُخرى.
        </p>
        <p>
          إن أردت مساعدة في الحصول على مواقع دراسية تساعدك على تعّلم ودراسة
          الكتاب المقدس، الرجاء لا تتردد بمراسلتنا لطلب المعونة في الحصول على
          هذه الموارد أو بعض المواقع والتطبيقات التي ننصح بها في سبيل النمو في
          النعمة ومعرفة الكلمة.
        </p>
        <p>
          ”وَلْتَكُنْ مَعَكُمْ جَمِيعاً نِعْمَةُ رَبِّنَا يَسُوعَ الْمَسِيحِ،
          وَمَحَبَّةُ اللهِ، وَشَرِكَةُ الرُّوحِ الْقُدُسِ.“ (كورنثوس الثانية
          ١٣: ١٤)
        </p>
        <p>
          لقد قمنا بتبني النص الذي أعدَّه المبشر جاستن بيترز كونه يقدم رسالة
          الإنجيل بأمانة. يُمكنكم الوصول إلى نسخته الإنجليزية من هنا.
        </p>
      </section>
    </>
  );
}
